import { BalenzQuestion } from '@/app/(main)/balenz-test/questions/types/question';

export const MOCK_QUESTIONS: BalenzQuestion[] = [
  {
    id: 1,
    content: '정부는 사회적 불평등을 줄이기 위해 적극적으로 개입해야 한다.',
  },
  {
    id: 2,
    content: '개인의 자유는 사회 전체의 안전보다 우선되어야 한다.',
  },
  {
    id: 3,
    content:
      '질문 내용을 작성해주세요. 이 텍스트 박스의 경우, 가로폭 846px을 기본으로 하되 이보다 적은 내용을 다룰 때에는 가운데 정렬을 진행해주세요. 또한, 말줄임표 사용없이 쭉 나열해서 작성해주시면 됩니다.',
  },
  {
    id: 4,
    content:
      '질문 내용을 작성해주세요. 이 텍스트 박스의 경우, 가로폭 846px을 기본으로 하되 이보다 적은 내용을 다룰 때에는 가운데 정렬을 진행해주세요. 또한, 말줄임표 사용없이 쭉 나열해서 작성해주시면 됩니다.',
  },
  {
    id: 5,
    content:
      '질문 내용을 작성해주세요. 이 텍스트 박스의 경우, 가로폭 846px을 기본으로 하되 이보다 적은 내용을 다룰 때에는 가운데 정렬을 진행해주세요. 또한, 말줄임표 사용없이 쭉 나열해서 작성해주시면 됩니다.',
  },
  {
    id: 6,
    content:
      '질문 내용을 작성해주세요. 이 텍스트 박스의 경우, 가로폭 846px을 기본으로 하되 이보다 적은 내용을 다룰 때에는 가운데 정렬을 진행해주세요. 또한, 말줄임표 사용없이 쭉 나열해서 작성해주시면 됩니다.',
  },
];
